aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio _before taking WICED changes.c
    /* Store callback info */
    obj->callback     = (void*)callback;
    obj->callback_arg = callback_arg;
}


/***************************************************************************************************
 * cyhal_sdio_enable_event
 **************************************************************************************************/
void cyhal_sdio_enable_event(cyhal_sdio_t* obj, cyhal_sdio_event_t event, uint8_t intr_priority,
                             bool enable)
{
    (void)intr_priority;
    if (enable)
    {
        __HAL_SD_ENABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        obj->irq |= (uint32_t)event;
    }
    else
    {
        __HAL_SD_DISABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        obj->irq &= ~(uint32_t)event;
    }
}


/***************************************************************************************************
 * stm32_cyhal_sdio_irq_handler
 **************************************************************************************************/
void stm32_cyhal_sdio_irq_handler(void)
{
    if ((_cyhal_sdio_handle != NULL) &&
        (__HAL_SD_GET_FLAG(_cyhal_sdio_handle, SDIO_STA_SDIOIT) != RESET))
    {
        cyhal_sdio_t* obj = (cyhal_sdio_t*)_cyhal_sdio_handle->Context;
        ((cyhal_sdio_event_callback_t)obj->callback)(obj->callback_arg, CYHAL_SDIO_CARD_INTERRUPT);

        /* Clear the interrupt */
        __HAL_SD_CLEAR_FLAG(_cyhal_sdio_handle, SDIO_FLAG_SDIOIT);

        /* Mask interrupt, to be unmasked later by Tx Path */
        __HAL_SD_DISABLE_IT(_cyhal_sdio_handle, SDIO_IT_SDIOIT);

        /* Set IRQ Flag which will be used for setting IRQ MASK back */
        obj->irq |= (uint32_t)CYHAL_SDIO_CARD_INTERRUPT;
    }
}


/***************************************************************************************************
 * Private Functions
 **************************************************************************************************/

/***************************************************************************************************
 * _stm32_safe_divide
 **************************************************************************************************/
static uint32_t _stm32_safe_divide(uint32_t num, uint32_t denom)
{
    /* Safe divide */
    uint32_t divres;

    assert_param(num != 0u);
    assert_param(denom != 0u);
    divres = num / denom;
    if ((num % denom) >= (denom>>1))
    {
        divres++;
    }
    return divres;
}


/***************************************************************************************************
 * _stm32_sdio_enable_hw_block
 **************************************************************************************************/
static void _stm32_sdio_enable_hw_block(cyhal_sdio_t* obj)
{
    /* Disable/reset SDIO Block */
    _stm32_sdio_disable_hw_block(obj);

    /* Enable the SDIO Clock */
    #if defined (SDMMC1)
    if (obj->hsd->Instance == SDMMC1)
    {
        __HAL_RCC_SDMMC1_CLK_ENABLE();
    }
    #endif
    #if defined (SDMMC2)
    else
    {
        __HAL_RCC_SDMMC2_CLK_ENABLE();
    }
    #endif
    //ANN added below
    #if defined (SDIO)
    {
    	if (obj->hsd->Instance == SDIO)
    	{
     		/* Enable clocks for SDIO and DMA2 */
   			//rcc_peripheral_enable_clock(&RCC_APB2ENR, RCC_APB2ENR_SDIOEN);
     		 //__HAL_RCC_PWR_CLK_ENABLE();

    		 //Enable the SDIO APB2 Clock
    		  //RCC_APB2PeriphClockCmd(RCC_APB2ENR_SDIOEN, ENABLE);
    		  __HAL_RCC_SDIO_CLK_ENABLE();
    	/*do {
    	   __IO uint32_t tmpreg;
    	   //SET_BIT(RCC->AHB2ENR, 0x00000200);
    	   SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);

    	   // Delay after an RCC peripheral clock enabling
    	   tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);
    	   UNUSED(tmpreg);
    	   } while(0);*/
    	}
    }
    #endif

    /* Initialize SDMMC peripheral interface with default configuration */
    //(void)SDMMC_Init(obj->hsd->Instance, obj->hsd->Init);

      obj->hsd->Init.ClockDiv = (uint32_t)0x76;

      (void)SDIO_Init(obj->hsd->Instance, obj->hsd->Init);

    /* Set Power State to ON */
    //(void)SDMMC_PowerState_ON(obj->hsd->Instance);
    (void)SDIO_PowerState_ON(obj->hsd->Instance);
//#if(0)
    /* Wait clock */
    //(void)SDMMC_SetSDMMCReadWaitMode(obj->hsd->Instance, SDIO_READ_WAIT_MODE_CLK);
    (void)SDIO_SetSDMMCReadWaitMode(obj->hsd->Instance, SDIO_READ_WAIT_MODE_CLK);


    //uint32_t sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC) /
    //                     (2U * obj->hsd->Init.ClockDiv);


//#endif
    uint32_t sdmmc_clk = LL_RCC_GetSDIOClockFreq(LL_RCC_SDIO_CLKSOURCE) /
                        (2U * obj->hsd->Init.ClockDiv);


    if (sdmmc_clk != 0U)
    {
        /* Wait 74 Cycles: required power up waiting time
         * before starting the SD initialization sequence */
        HAL_Delay(1U + (74U * 1000U / (sdmmc_clk)));
    }
   /* else
    {
        HAL_Delay(2U);
    }*/

}

/***************************************************************************************************
 * _stm32_sdio_disable_hw_block
 **************************************************************************************************/
static void _stm32_sdio_disable_hw_block(const cyhal_sdio_t* obj)
{
    /* Reset SDIO Block */
    //(void)SDMMC_PowerState_OFF(obj->hsd->Instance);
	(void)SDIO_PowerState_OFF(obj->hsd->Instance);
    #if defined (SDMMC1)
    if (obj->hsd->Instance == SDMMC1)
    {
        __HAL_RCC_SDMMC1_FORCE_RESET();
        __HAL_RCC_SDMMC1_RELEASE_RESET();
    }
    #endif
    #if defined (SDMMC2)
    else
    {
        __HAL_RCC_SDMMC2_FORCE_RESET();
        __HAL_RCC_SDMMC2_RELEASE_RESET();
    }
    #endif
//ANN added below
    #if defined (SDIO)
    {
    	 __HAL_RCC_SDIO_FORCE_RESET();
    	 __HAL_RCC_SDIO_RELEASE_RESET();
    }
	#endif
}


/***************************************************************************************************
 * _stm32_sdio_find_optimal_block_size
 **************************************************************************************************/
static  uint32_t _stm32_sdio_find_optimal_block_size(uint32_t data_size)
{
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_256B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_512B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_128B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_256B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_64B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_128B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_32B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_64B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_16B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_32B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_8B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_16B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_4B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_8B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_2B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_4B;
    }
    return _CYHAL_SDIO_DATA_BLOCK_SIZE_4B;
}


/***************************************************************************************************
 * _stm32_sdio_convert_block_size
 **************************************************************************************************/
static uint32_t _stm32_sdio_convert_block_size(uint16_t block_size)
{
    switch (block_size)
    {
        case 1:
            return SDIO_DATABLOCK_SIZE_1B;

